#!/usr/bin/perl
use strict;
use warnings FATAL => 'all';
use v5.10;

my $line = "12345678901234567890^643^+99.99^Иван^Иванович^^^^^^^^^^^^^^^^^^^^^22.09.1999^МУЖСКОЙ^ХОЛОСТ^";
#my $line = "12345678901234567890^643^+99.99^Иван^Иванович^22.09.1999^МУЖСКОЙ^ХОЛОСТ^";

if ($line =~ /^
            \d{20}\^\s*
            \d{3}\s*\^
            [\+\-]?[\d\s]*[\.\,\-\=]?\d{0,2}\s*\^
            ([^\^]*\^){5,8}$
            /x
) {
    say 'NORMAL REGEXP!';
}



if ($line =~ /^
            \d{20}\^\s*
            \d{3}\s*\^
            [\+\-]?[\d\s]*[\.\,\-\=]?\d{0,2}\s*\^
            (.*\^){5,8}$
            /x
) {
    say 'STUPID REGEXP!';
}